/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   main.c                                             :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: ccumming <marvin@42.fr>                    +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2018/09/21 22:35:03 by ccumming          #+#    #+#             */
/*   Updated: 2018/09/21 22:53:15 by ccumming         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include <stdio.h>

int		ft_sort_integer_table(int *tab, int size);

int		main()
{
	int tab[8] = {4,5,6,3,22,34,45,32};
	int i;

	ft_sort_integer_table(tab, 8);

	for (i = 0; i<7; i++) 
	{
		printf("%d = ", tab[i]);
		//scanf("%d", &a[i]); // &a[i] - адрес i-го элемента массива
	}
	return(0);
}	
